/*某公司员工的工资计算方法如下：一周内工作时间不超过40小时，按正常工作时间计酬；超出40小时的工作时间部分，按正常工作时间报酬的1.5倍计酬。*/
/*员工按进公司时间分为新职工和老职工，进公司不少于5年的员工为老职工，5年以下的为新职工。新职工的正常工资为30元/小时，老职工的正常工资为50元/小时。请按该计酬方式计算员工的工资。*/
#include<stdio.h>
int main()
{
int y,h;
float m;
scanf("%d %d",&y,&h);
    if(y>=5&&h<=40)
      {
      m=h*50;
       printf("%.2f",m);
      }
    else if(y>=5&&h>40)
    {
    m=2000+(h-40)*75;
    printf("%.2f",m);
    }
    else if(y<5&&h<=40)
    {
      m=h*30;
      printf("%.2f",m);  
    }
    else if(y<5&&h>40)
    {
        m=1200+(h-40)*45;
        printf("%.2f",m);
    }
    return 0;
}
